brew "fzf"
brew "fd" # fast find replacement; powers fzf's file/dir walkers
brew "ripgrep" # fast grep replacement (rg)
brew "fzf-tab" # replaces zsh tab-completion menu with an fzf picker
brew "zoxide" # shell ext. to jump to frequently used dirs (modern autojump)
brew "git"
brew "mise"
brew "bat"
brew "gh"
brew "lazygit"
brew "hyperfine" # statistical benchmarking; used by bench/bench.zsh
brew "stow" # symlink farm manager; install.sh uses it to link configs into $HOME
brew "neovim" # editor; config lives in the nvim stow package
brew "luarocks" # Lua package manager; some nvim plugins need it

cask "ghostty"
cask "music-decoy" # https://lowtechguys.com/musicdecoy/
cask "font-jetbrains-mono-nerd-font" # nerd font for nvim/terminal glyphs
